import { Box, Container, Typography } from '@mui/material';
import React from 'react';

const UnionInformation = () => {
    return (
        <Box className='mt-10 mb-32'>
            <Container className='lg:pb-5'>
                <Typography variant='h5' className='font-semibold text-2xl mb-3'>সোনাদিয়া ইউনিয়ন পরিষদ তথ্য</Typography>
                <div className='text-gray-700'>
                    <p className='border-t border-black mb-5'></p>
                    <Typography className='mb-3'>সোনাদিয়া ইউনিয়নের ইতিহাস</Typography>
                    <hr  className='mb-20'/>
                    <p className='mb-5'>সোনাদিয়া ইউনিয়নটি নোয়াখালী জেলার হাতিয়া উপজেলার অধীন একটি ইউনিয়ন। আদমশুমারী ২০২১ তথ্য মতে সোনাদিয়ার আয়তন ৯০.৫২ বর্গ কিলোমিটার, জনসংখ্যা প্রায় ৪৭ হাজার। তিনটি মৌজা চরচেংগা, মাইজচরা ও সোনাদিয়া মৌজার সমন্বয়ে ইউনিয়নটি গঠিত হলেও সোনাদিয়া মৌজার নামে ইউনিয়নটির নামকরন করা হয়। হাতিয়া উপজেলার মোট ১১ টি ইউনিয়নের মধ্যে এটির অবস্থান ৮ নম্বরে।  ইউনিয়নটিতে মোট ৯ টি ওয়ার্ড রয়েছে। </p>
                    <p className='mb-5'>সীমানাঃ সোনাদিয়ার পশ্চিমে মেঘনা নদী, দক্ষিণে জাহাজমারা ইউনিয়ন , পূর্বে বুডিরচর ইউনিয়ন এবং উত্তরে তমরুদ্দিন ইউনিয়ন।</p>
                    <p className='mb-5'>পটভূমিঃ হাতিয়ার বয়স তিনহাজার বছর হলেও সোনাদিয়ার বয়স ৫০০-৬০০ বৎসর হবে তবে জনবসতি গড়ে উঠেছে আনুমানিক ২৫০-২৩০ বৎসর পূর্বে।জেমস রেনেল (১৭৮০) হাতিয়ার চর গুলোর তেমন বিবরন দেননি তবে শাহাবাজ পুরের বিবরন দিয়েছেন।১৮২০ সালে হান্টার রিপোর্টে শাহবাজপুরের পাশে হাতিয়ার দক্ষিণ পশ্চিমে একাধিক চরে জেগেছে বলে উল্লেখ করেন সে হিসেবে বলা যায় সোনাদিয়া ও ভোলা প্রায় সম বয়সি চর । ১৯৫৮ সালে তমরুদ্দিন ইউনিয়ন হতে সোনাদিয়া ও বুড়িরচর আলাদা হয়ে স্বতন্ত্র দুইটি ইউনিয়ন গঠিত হয়। সোনাদিয়া ইউনিয়নের ১ম প্রেসিডেন্ট হন হাজী আলী আহম্মদ মিয়া। তিনি বৃটিশ আমল ১৯৩২ সাল থেকে ইউনিয়ন বোর্ডের প্রেসিডেন্ট, ১৯৫৯-১৯৬১ সালে মৌলিক গনতন্ত্রীর সময় ইউনিয়ন কাউন্সিলের চেয়ারম্যান এবং পরবর্তী ১৯৬২-৬৭ সাল পর্যন্ত ইউনিয়ন কাউন্সিলের চেয়ারম্যান ছিলেন। সব মিলিয়ে তিনি দীর্ঘ ৩৫ বৎসর চেয়ারম্যান ছিলেন তমরুদ্দিন ও সোনাদিয়া ইউনিয়নের। তিনি ছিলেন জন দরদী নেতা ও সোনাদিয়া ইউনিয়নের প্রতিষ্ঠাতা।</p>
                    <p className='mb-5'>সোনাদিয়া ইউনিয়নের নামকরনঃ সোনাদিয়ার পূর্ব নাম ছিল নবাবপুর, তা হতে সোনাদিয়া নামকরন বেশি দিনের নয়। তমরুদ্দী হতে এ ইউনিয়ন পৃথক হলে হাজী আলী আহমদ মিয়া তার বাবা নবাব মিয়ার নামানুসারে নাম দেন নবাবপুর । মকসুদ মিয়া তা মেনে নিতে পারেননি। মকসুদ মিয়া সোনাদিয়ার নামকরন করেন। তাছাড়া সে সময় নামকরন করা হত বিখ্যাত ও বিশিষ্ট ব্যাক্তিদের নামানুসারে। সে অনুসারে সোনাদিয়ার পূর্ব নাম ছিল নবাবপুর। এ নাম নিয়ে তৎকালীন সেক্রেটারী ও তৎকালীন নবাবপুরের চেয়ারম্যান আলী আহমদ মিয়ার সাথে প্রচন্ড বাক-বিতান্ড হয় হয় কালেক্টর অফিসে। পরে কালেক্টরের হস্তক্ষেপে পরিবেশ ও প্রকৃতির সৌন্দর্যকে প্রাধান্য দিয়ে সোনাদিয়া ইউনিয়নের নামকরন করা হয়। এ চরে এত বেশি সোনালি ফসল হত বলে তাই তার নামকরন করা হয় সোনাদিয়া। অর্থাৎ সোনালি ফসলে দিয়ে ভরপুর ছিল বলে সোনাদিয়ার নামকরন করা হয়।</p>
                </div>
            </Container>
        </Box>
    );
};

export default UnionInformation;